<template>
  <div class="default-page description-page">
    <div class="content">
      <h1>Короткий опис компонентів:</h1>

      <p>
        Основний компонент <b>Project</b>, який складається з трьох ключових компонентів:
        <b>Filters</b>, <b>ProjectTable</b> і <b>Pagination</b>. Вся логіка завантаження даних,
        фільтрації і пагінації інкапсульована в <b>useProcessUsers composable</b>.
        [Псевдо]Завантаження даних відбувається з локального JSON файлу <b>seeders/users.json</b> з
        затримкою в 1 секунду для імітації API реквеста, під час якого на екрані відображається
        спіннер загрузки.
      </p>

      <p>
        Компонент <b>Filters</b> відповідає за зміну полів value в об'єктах фільтрів масива
        <b>filtersData</b>. Є два типи фільтрів: <u>search</u> (значення якого записується в
        текстове поле компонента <b>BaseSearch</b>) і <u>sorting</u> (значення якого вибирається з
        опцій селекта компонента <b>BaseSorting</b>). Масив <b>filtersData</b> не змінюється
        компонентом <b>Filters</b> напряму, а використовує локальний масив, щоб забезпечити
        коректний функціонал кнопок <b>"Знайти"</b>, <b>"Скинути фільтр"</b> і
        <b>"Скинути сортування"</b>.
        <br />
        <i
          >* Решту кнопок зі скріншота макету я вирішив зробити неактивними, оскільки на цьому етапі
          вони не мають функціоналу.</i
        >
      </p>

      <p>
        Компонент <b>ProjectTable</b> містить таблицю, яка відображає дані юзерів, розбитих по
        колонках. Контент таблиці, а саме хедер, тіло і футер, керується через
        <b>useTableContents composable</b>.
      </p>

      <p>
        Компонент <b>Pagination</b> відображає звичайні інструменти пагінації: кнопки вперед/назад,
        поле для вводу бажаної сторінки (стоїть обмежувач при введенні неіснуючої сторінки) і селект
        для зміни кількості відображуваних юзерів у таблиці.
      </p>
    </div>
  </div>
</template>

<script setup>
defineOptions({
  name: 'DescriptionPage',
});
</script>

<style scoped lang="scss">
.content {
  max-width: 800px;
  margin: 0 auto;
  padding: 50px;
  font-size: 16px;
  line-height: 150%;
  color: $color-black;

  @media (max-width: $md) {
    max-width: none;
    padding: 32px 16px;
  }

  & > * {
    &:not(:last-child) {
      margin-bottom: 20px;
    }
  }
}
</style>
